//
//  Biography.swift
//  EpameinondasZymvrakakis
//
//  Created by Angelos Staboulis on 10/1/25.
//

import SwiftUI

struct Biography: View {
    @State var biography = """
 Ο αντιστράτηγος Επαμεινώνδας Ζυμβρακάκης (Ζυμπρακάκης) ή Παμίκος Ζυμβρακάκης (1863 - 1922) ήταν Έλληνας στρατιωτικός και κινηματίας.

 Βιογραφία
 Ήταν γιος του στρατιωτικού και πολιτικού Χαράλαμπου της ιστορικής οικογένειας Ζυμβρακάκη. Γεννήθηκε το 1863 στο Ναύπλιο. Κατατάχθηκε ως εθελοντής στο στρατό το 1882 και αργότερα στη Σχολή Υπαξιωματικών από την οποία και εξήλθε το 1888 ως ανθυπίλαρχος. Για τη συμπλήρωση των σπουδών του στάλθηκε στη Γαλλία. Κατά τις Κρητικές επαναστάσεις του 1886 και 1897 μετείχε ως εθελοντής.

 Το 1909 ο Επαμεινώνδας Ζυμβρακάκης ήταν από τους κυριότερους εμπνευστές και δημιουργούς του Κινήματος του 1909 ως μέλος της διοικούσας επιτροπής του Στρατιωτικού Συνδέσμου, ίλαρχος τότε. Όταν εξερράγη το κίνημα της Θεσσαλονίκης μετέβη από τους πρώτους εκεί στο πλευρό του Ε. Βενιζέλου όπου και ανέλαβε ως μέραρχος σε όλες τις πολεμικές επιχειρήσεις της Αντάντ που συνέβησαν το 1918 στη Μακεδονία. Ήταν μέλος της Αθηναϊκής Λέσχης και γυναικαδελφός του Γ. Ταμπακόπουλου. Πέθανε το 1922 φέροντας το βαθμό αντιστράτηγου. Ήταν παντρεμένος με τη Μάσσιγκα (ή Μασούτα) Ι. Ταμπακοπούλου.

 """
     @EnvironmentObject var viewModel:ViewModel
     var body: some View {
         ScrollView{
                         Image(.papyrus).overlay {
                             VStack{
                                 Image(.zymvrakakis).resizable().frame(width:100,height:95,alignment: .top)
                                 ScrollView{
                                     Text(viewModel.createBiography(biography: biography)).frame(width:350)
                                 }
                             }
                         }
          }
     }
}

#Preview {
    Biography()
}
